### ※ Pandas p.46~

In [18]:
import pandas as pd
from pandas import Series, DataFrame

data = {
    'subject': ['c','c++','java','python'],
    'score' : [88,50,30,100]
}
df = pd.DataFrame(data)
df

  subject  score
0       c     88
1     c++     50
2    java     30
3  python    100

In [6]:
df = pd.DataFrame(data, columns = ['score','subject'])
df

   score subject
0     88       c
1     50     c++
2     30    java
3    100  python

In [9]:
df = pd.DataFrame(data, columns=['score','subject','count'])
df

   score subject count
0     88       c   NaN
1     50     c++   NaN
2     30    java   NaN
3    100  python   NaN

In [10]:
df = pd.DataFrame(data, index = [1,2,3,4])
df

  subject  score
1       c     88
2     c++     50
3    java     30
4  python    100

In [33]:
data = pd.read_csv('titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
DataFrame(data, columns = ['sex','city']).head()

   sex  city
0  NaN   NaN
1  NaN   NaN
2  NaN   NaN
3  NaN   NaN
4  NaN   NaN

In [31]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
df = DataFrame(data, columns = ['sex','city','salary'])
df.head()

   sex  city  salary
0  NaN   NaN     NaN
1  NaN   NaN     NaN
2  NaN   NaN     NaN
3  NaN   NaN     NaN
4  NaN   NaN     NaN

In [39]:
df = DataFrame(data)
df.head()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [41]:
df.Name, df['Name']

(0                                Braund, Mr. Owen Harris
 1      Cumings, Mrs. John Bradley (Florence Briggs Th...
 2                                 Heikkinen, Miss. Laina
 3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
 4                               Allen, Mr. William Henry
                              ...
 886                                Montvila, Rev. Juozas
 887                         Graham, Miss. Margaret Edith
 888             Johnston, Miss. Catherine Helen "Carrie"
 889                                Behr, Mr. Karl Howell
 890                                  Dooley, Mr. Patrick
 Name: Name, Length: 891, dtype: object,
 0                                Braund, Mr. Owen Harris
 1      Cumings, Mrs. John Bradley (Florence Briggs Th...
 2                                 Heikkinen, Miss. Laina
 3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
 4                               Allen, Mr. William Henry
                              ...
 886                                Montvila, Rev. Juozas
 887                         Graham, Miss. Margaret Edith
 888             Johnston, Miss. Catherine Helen "Carrie"
 889                                Behr, Mr. Karl Howell
 890                                  Dooley, Mr. Patrick
 Name: Name, Length: 891, dtype: object)

In [42]:
df = DataFrame(data, columns = ['sex','city','salary'])
df.head()

   sex  city  salary
0  NaN   NaN     NaN
1  NaN   NaN     NaN
2  NaN   NaN     NaN
3  NaN   NaN     NaN
4  NaN   NaN     NaN

In [43]:
df.rename( columns = {'salary':'sal'})

     sex  city  sal
0    NaN   NaN  NaN
1    NaN   NaN  NaN
2    NaN   NaN  NaN
3    NaN   NaN  NaN
4    NaN   NaN  NaN
..   ...   ...  ...
886  NaN   NaN  NaN
887  NaN   NaN  NaN
888  NaN   NaN  NaN
889  NaN   NaN  NaN
890  NaN   NaN  NaN

[891 rows x 3 columns]

In [44]:
data = {
    'subject':['c','c++','java','python'],
    'score' : [88,50,30,100]
}
df = pd.DataFrame(data)
df

  subject  score
0       c     88
1     c++     50
2    java     30
3  python    100

In [45]:
df.T

          0    1     2       3
subject   c  c++  java  python
score    88   50    30     100

### 2.2.3 Index 객체

In [46]:
idx = pd.Index([1,2,3,4,5])
idx

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [47]:
idx[0]

1

In [48]:
idx[::2]

Int64Index([1, 3, 5], dtype='int64')

In [49]:
print(idx.size, idx.shape, idx.ndim, idx.dtype)

5 (5,) 1 int64

In [51]:
idx[1] = 123

TypeError: Index does not support mutable operations

In [53]:
import numpy as np
df = pd.DataFrame( np.arange(9).reshape(3,3), index=[1,3,5], columns = ['x','y','z'])
df

   x  y  z
1  0  1  2
3  3  4  5
5  6  7  8

In [54]:
df2 = df.reindex([1,2,3,4], method = 'ffill')
df2

   x  y  z
1  0  1  2
2  0  1  2
3  3  4  5
4  3  4  5

In [55]:
col = [ 'x','y','v','z' ]
df2.reindex(columns=col, method='ffill')

   x  y   v  z
1  0  1 NaN  2
2  0  1 NaN  2
3  3  4 NaN  5
4  3  4 NaN  5

### 2.3 데이터 선택하기

In [56]:
from pandas import Series, DataFrame
df = pd.read_csv('titanic.csv')
df['Age'].head(3)

0    22.0
1    38.0
2    26.0
Name: Age, dtype: float64

In [57]:
df[['Name','Sex','Age']].head(3)

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0

In [58]:
df[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [60]:
df['Name'][:3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [61]:
import numpy as np
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [63]:
data['b']

0.5

In [64]:
'a' in data

True

In [66]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [68]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [81]:
Age_Series = df[['Age','Name']]
Age_Series[1:10:2],Age_Series[1:10:2].head(3)

(    Age                                               Name
 1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
 3  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
 5   NaN                                   Moran, Mr. James
 7   2.0                     Palsson, Master. Gosta Leonard
 9  14.0                Nasser, Mrs. Nicholas (Adele Achem),
     Age                                               Name
 1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
 3  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
 5   NaN                                   Moran, Mr. James)

In [87]:
Age_Series = df['Age']
Age_Series[[1,10,2]]
# Age_Series[[1,10,2]].head(3)

1     38.0
10     4.0
2     26.0
Name: Age, dtype: float64

In [100]:
data = pd.Series(['a','b','c'], index=[100,200,300])
data

100    a
200    b
300    c
dtype: object

In [102]:
data[100]

'a'

In [105]:
data[1:3]

200    b
300    c
dtype: object

In [104]:
data.loc[100]

'a'

In [97]:
data.iloc[1]

'b'

In [103]:
data.loc[100:300]

100    a
200    b
300    c
dtype: object

In [99]:
data.iloc[1:3]

2    b
3    c
dtype: object

In [107]:
data[[100,200]]

100    a
200    b
dtype: object

In [121]:
data = pd.Series([0.25,0.50,0.75,1], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [111]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [112]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [118]:
data[ (data>0.3) & (data <0.8)]

b    0.50
c    0.75
dtype: float64

In [119]:
data[ data<=0.5]

a    0.25
b    0.50
dtype: float64

In [122]:
data[['a', 'd']]

a    0.25
d    1.00
dtype: float64

In [184]:
import pandas as pd
from pandas import Series, DataFrame
df = pd.read_csv('titanic.csv')

In [187]:
df.loc[df['Age']>60,['PassengerId','Survived']].head()

     PassengerId  Survived
33            34         0
54            55         0
96            97         0
116          117         0
170          171         0

In [188]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [145]:
df.index = df['Name']
del df['Name']
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [146]:
df[['Sex','Age']][:2]

                                                       Sex   Age
Name
Braund, Mr. Owen Harris                               male  22.0
Cumings, Mrs. John Bradley (Florence Briggs Tha...  female  38.0

In [147]:
df.loc['Braund, Mr. Owen Harris', 'Age']

22.0

In [153]:
df.iloc[:4,4:5]

                                                     Age
Name
Braund, Mr. Owen Harris                             22.0
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0
Heikkinen, Miss. Laina                              26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)        35.0

In [131]:
df.iloc[:4,:3]

,PassengerId,Survived,Pclass
Name,,,
"Braund, Mr. Owen Harris",1,0,3
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1
"Heikkinen, Miss. Laina",3,1,3
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1

In [133]:
import pandas as pd
from pandas import Series, DataFrame
df = pd.read_csv('titanic.csv')    

df.drop(1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [136]:
df.drop([1,3,5,7]).head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [140]:
df.drop('Fare', axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [142]:
df.drop([0,1,2], axis=0).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

###

### 2.4 데이터프레임 연산

In [155]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

s1 = Series([1,2,3,4], index = ['a','b','c','d'])
s2 = Series([4,3,2,1], index = ['a','b','e','f'])
s1+s2

a    5.0
b    5.0
c    NaN
d    NaN
e    NaN
f    NaN
dtype: float64

In [156]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=['서울','대전','대구'], index=['a','b','c'])
df2 = DataFrame(np.arange(9).reshape(3,3), columns=['서울','대전','대구'], index=['a','b','c'])

print(df1)
print(df2)
print(df1+df2)

   서울  대전  대구
a   0   1   2
b   3   4   5
c   6   7   8
   서울  대전  대구
a   0   1   2
b   3   4   5
c   6   7   8
   서울  대전  대구
a   0   2   4
b   6   8  10
c  12  14  16

In [158]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=['서울','대전','대구'], index=['a','b','c'])
df2 = DataFrame(np.arange(9).reshape(3,3), columns=['서울','대전','부산'], index=['a','b','d'])

print(df1)
print(df2)
print(df1+df2)

   서울  대전  대구
a   0   1   2
b   3   4   5
c   6   7   8
   서울  대전  부산
a   0   1   2
b   3   4   5
d   6   7   8
   대구   대전  부산   서울
a NaN  2.0 NaN  0.0
b NaN  8.0 NaN  6.0
c NaN  NaN NaN  NaN
d NaN  NaN NaN  NaN

In [160]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=['a','b','c'])
df2 = DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'])

print(df1)
print(df2)
print(df1+df2)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8
   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d
0   0   2   4 NaN
1   7   9  11 NaN
2  14  16  18 NaN

In [161]:
df1.add(df2, fill_value=0)

    a   b   c     d
0   0   2   4   3.0
1   7   9  11   7.0
2  14  16  18  11.0

In [175]:
arr = np.arange(12).reshape(3,4)

arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [166]:
df = DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'])
df

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [168]:
s1 = df.loc[0]
s1

a    0
b    1
c    2
d    3
Name: 0, dtype: int32

In [169]:
df - s1

   a  b  c  d
0  0  0  0  0
1  4  4  4  4
2  8  8  8  8

In [171]:
df = DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'])
df

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [172]:
s1 = df['a']
s1

0    0
1    4
2    8
Name: a, dtype: int32

In [173]:
df-s1

    a   b   c   d   0   1   2
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

In [174]:
df.sub(s1,axis=0)

   a  b  c  d
0  0  1  2  3
1  0  1  2  3
2  0  1  2  3

In [181]:
s2 = df[0:1]
s2

   a  b  c  d
0  0  1  2  3

In [182]:
df-s2

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN

### 2.5 Pandas U Function

In [201]:
f = lambda x:x*x
f(2)

values = [i for i in map(lambda x:x**x, range(5))]
values

[1, 1, 4, 27, 256]

In [203]:
values = [1,2,3,4,5]
list(map(lambda x:x*2, values))

[2, 4, 6, 8, 10]

In [204]:
mask = [1,0,1,0,1]
list(map(lambda x,y,z: x*y+z, values, mask, range(5)))

[1, 1, 5, 3, 9]

In [205]:
s = Series(np.arange(10))
s.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [209]:
s.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [210]:
dic = {1:'a',2:'b',3:'c'}
s.map(dic).head(5)

0    NaN
1      a
2      b
3      c
4    NaN
dtype: object

In [213]:
__s = Series(np.arange(10,20))
s.map(__s).head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [215]:
df = pd.read_csv('wages.csv')
df.head()

          earn  height     sex   race  ed  age
0  79571.29901   73.89    male  white  16   49
1  96396.98864   66.23  female  white  16   62
2  48710.66695   63.77  female  white  16   33
3  80478.09615   63.22  female  other  16   95
4  82089.34550   63.08  female  white  17   43

In [216]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070007     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790720    63.720000    12.000000    33.000000
50%     26877.870180    66.050000    13.000000    42.000000
75%     44506.215340    69.315000    15.000000    55.000000
max    317949.128000    77.210000    18.000000    95.000000

In [218]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [219]:
df['sex_code'] = df.sex.map({'male':0, 'female':1})
df.head()

          earn  height     sex   race  ed  age  sex_code
0  79571.29901   73.89    male  white  16   49         0
1  96396.98864   66.23  female  white  16   62         1
2  48710.66695   63.77  female  white  16   33         1
3  80478.09615   63.22  female  other  16   95         1
4  82089.34550   63.08  female  white  17   43         1

In [220]:
df.sex.replace({'male':0,'female':1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [221]:
df.sex.replace(['male','female'],[0,1],inplace=True)
df.head(5)

          earn  height  sex   race  ed  age  sex_code
0  79571.29901   73.89    0  white  16   49         0
1  96396.98864   66.23    1  white  16   62         1
2  48710.66695   63.77    1  white  16   33         1
3  80478.09615   63.22    1  other  16   95         1
4  82089.34550   63.08    1  white  17   43         1

In [230]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

df = DataFrame(np.random.randn(3,4), columns = list("abcd"))
df

          a         b         c         d
0  1.519129 -1.063050  1.077592 -1.709325
1  0.871574 -2.635347  0.029483 -1.155150
2  0.642199 -1.215186  0.306109  0.401582

In [232]:
df.apply( lambda x : x.max())

a    1.519129
b   -1.063050
c    1.077592
d    0.401582
dtype: float64

In [234]:
df.apply( lambda x: x.max(), axis=1)

0    1.519129
1    0.871574
2    0.642199
dtype: float64

In [244]:
df.applymap(lambda x: '%.1f' %x)

     a     b    c     d
0  1.5  -1.1  1.1  -1.7
1  0.9  -2.6  0.0  -1.2
2  0.6  -1.2  0.3   0.4

In [260]:
df = pd.read_csv('wages.csv')
df

              earn  height     sex   race  ed  age
0     79571.299010   73.89    male  white  16   49
1     96396.988640   66.23  female  white  16   62
2     48710.666950   63.77  female  white  16   33
3     80478.096150   63.22  female  other  16   95
4     82089.345500   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380360   71.68    male  white  12   33
1375  24853.519510   61.31  female  white  18   86
1376  13710.671310   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [261]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070007     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790720    63.720000    12.000000    33.000000
50%     26877.870180    66.050000    13.000000    42.000000
75%     44506.215340    69.315000    15.000000    55.000000
max    317949.128000    77.210000    18.000000    95.000000

In [263]:
df['race'].unique()
list(enumerate(df['race'].unique()))
np.array(list(enumerate(df['race'].unique())))

array([['0', 'white'],
       ['1', 'other'],
       ['2', 'hispanic'],
       ['3', 'black']], dtype='<U11')

In [264]:
values = np.array(list(enumerate(df['race'].unique())))[:,0].tolist()
keys = np.array(list(enumerate(df['race'].unique())))[:,1].tolist()

values, keys
df['race'].replace(to_replace = keys, value = values, inplace = True)
df.head(5)

          earn  height     sex race  ed  age
0  79571.29901   73.89    male    0  16   49
1  96396.98864   66.23  female    0  16   62
2  48710.66695   63.77  female    0  16   33
3  80478.09615   63.22  female    1  16   95
4  82089.34550   63.08  female    0  17   43

In [268]:

df = DataFrame(np.random.randn(3,4), columns=list("cbda"), index=[3,1,2])
df

          c         b         d         a
3 -0.073169  0.651974 -0.015667  0.923618
1  0.678559  1.942033  0.191101 -0.040912
2  0.037607  0.137725  0.438758 -0.017077

In [270]:
df['a'].sort_index()

1   -0.040912
2   -0.017077
3    0.923618
Name: a, dtype: float64

In [272]:
df.sort_index()

          c         b         d         a
1  0.678559  1.942033  0.191101 -0.040912
2  0.037607  0.137725  0.438758 -0.017077
3 -0.073169  0.651974 -0.015667  0.923618

In [277]:
df.sort_index(axis=1, ascending=False).sort_index(ascending = False)

          d         c         b         a
3 -0.015667 -0.073169  0.651974  0.923618
2  0.438758  0.037607  0.137725 -0.017077
1  0.191101  0.678559  1.942033 -0.040912

In [281]:
df.sort_values(['a','b'], ascending = False)

          c         b         d         a
3 -0.073169  0.651974 -0.015667  0.923618
2  0.037607  0.137725  0.438758 -0.017077
1  0.678559  1.942033  0.191101 -0.040912

In [1]:
import pandas as pd
df_rating = pd.read_csv("ratings.csv")
df_rating

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [37]:
df_movie = pd.read_csv("movies.csv")
df_movie
df_m = pd.read_csv("movies.csv")
df_m

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

### 1. 사용자가 평가한 모든 영화의 전체 평균 평점을 출력하세요

In [31]:
df_rating["rating"].mean()

3.501556983616962

### 2. 각 사용자별 평균 평점을 출력하세요.

In [34]:
df_rating.groupby("userId")["rating"].mean()

userId
1      4.366379
2      3.948276
3      2.435897
4      3.555556
5      3.636364
         ...
606    3.657399
607    3.786096
608    3.134176
609    3.270270
610    3.688556
Name: rating, Length: 610, dtype: float64

### 3. 각 영화별 평균 평점을 movieid, title, 평균평점 순으로 출력하세요

In [32]:
df_g = df_rating.groupby("movieId")["rating"].mean()
df_g
df_merge= pd.merge(df_g, df_movie, on='movieId')
df_merge[['movieId','rating','title']].sort_values(['rating','movieId'],ascending = False )

      movieId  rating                                              title
9693   187717     5.0                   Won't You Be My Neighbor? (2018)
9670   184245     5.0                            De platte jungle (1978)
9616   179135     5.0                              Blue Planet II (2017)
9615   179133     5.0                              Loving Vincent (2017)
9593   176601     5.0                                       Black Mirror
...       ...     ...                                                ...
3364     4580     0.5                                      Cyborg (1989)
3230     4371     0.5                                    Baby Boy (2001)
3023     4051     0.5  Horrors of Spider Island (Ein Toter Hing im Ne...
2929     3933     0.5                          Killer Shrews, The (1959)
2685     3604     0.5                                       Gypsy (1962)

[9724 rows x 3 columns]

In [44]:
movie_mean= df_rating.groupby("movieId")["rating"].mean()
movie_mean# 시리즈
result_df = movie_mean.to_frame() # 시리즈를 DataFrame으로 만들어줌
result_df.columns = ["average"] # 컬럼을 설정

df = pd.merge(df_m, result_df, left_on="movieId", right_index = True, how="inner")
df[["movieId","title","average"]]

      movieId                                      title   average
0           1                           Toy Story (1995)  3.920930
1           2                             Jumanji (1995)  3.431818
2           3                    Grumpier Old Men (1995)  3.259615
3           4                   Waiting to Exhale (1995)  2.357143
4           5         Father of the Bride Part II (1995)  3.071429
...       ...                                        ...       ...
9737   193581  Black Butler: Book of the Atlantic (2017)  4.000000
9738   193583               No Game No Life: Zero (2017)  3.500000
9739   193585                               Flint (2017)  3.500000
9740   193587        Bungo Stray Dogs: Dead Apple (2018)  3.500000
9741   193609        Andrew Dice Clay: Dice Rules (1991)  4.000000

[9724 rows x 3 columns]

### 4. 평균평점이 가장 높은 영화의 제목을 출력하세요 (동물이 있는 경우 모두 출력하세요)

In [47]:
df.loc[ df["average"] == df["average"].max()]['title']

48                                        Lamerica (1994)
87                   Heidi Fleiss: Hollywood Madam (1995)
121                      Awfully Big Adventure, An (1995)
405                                Live Nude Girls (1995)
432     In the Realm of the Senses (Ai no corrida) (1976)
                              ...
9611                                         Black Mirror
9633                                Loving Vincent (2017)
9634                                Blue Planet II (2017)
9688                              De platte jungle (1978)
9711                     Won't You Be My Neighbor? (2018)
Name: title, Length: 296, dtype: object

In [52]:
df.loc[ df["average"] == df["average"].max(),'title']

48                                        Lamerica (1994)
87                   Heidi Fleiss: Hollywood Madam (1995)
121                      Awfully Big Adventure, An (1995)
405                                Live Nude Girls (1995)
432     In the Realm of the Senses (Ai no corrida) (1976)
                              ...
9611                                         Black Mirror
9633                                Loving Vincent (2017)
9634                                Blue Planet II (2017)
9688                              De platte jungle (1978)
9711                     Won't You Be My Neighbor? (2018)
Name: title, Length: 296, dtype: object

### 5번 Comedy 영화 중 가장 평점이 낮은 영화 제목 출력 (동물이 있는 경우 모두 출력하세요)

In [53]:
comedyDf = df.loc[df["genres"].str.contains("Comedy")]
comedyDf.loc[comedyDf["average"]==comedyDf["average"].min(),['title','average']]

                                                  title  average
4439                             Born to Be Wild (1995)      0.5
4881                            Follow Me, Boys! (1966)      0.5
5258                              Secret Society (2002)      0.5
5409  Boudu Saved From Drowning (Boudu sauvé des eau...      0.5
5453         Carabineers, The (Carabiniers, Les) (1963)      0.5
5662                 Jesus Christ Vampire Hunter (2001)      0.5
5777                           Are We There Yet? (2005)      0.5
5795                                  Uncle Nino (2003)      0.5
6160                      Leprechaun 4: In Space (1997)      0.5
6545                              Daddy Day Camp (2007)      0.5
6554                       Brothers Solomon, The (2007)      0.5
6784                           Zombie Strippers! (2008)      0.5
7201                                    Old Dogs (2009)      0.5
7553                       Hard Ticket to Hawaii (1987)      0.5
7762                            Arthur Christmas (2011)      0.5
7820            Journey 2: The Mysterious Island (2012)      0.5
8248  Maria Bamford: The Special Special Special! (2...      0.5
8417                          Haunted House 2, A (2014)      0.5
8676                               Tooth Fairy 2 (2012)      0.5
8893                                       Aloha (2015)      0.5
8908               The Star Wars Holiday Special (1978)      0.5
8984                 Joe Dirt 2: Beautiful Loser (2015)      0.5
9056                            Saving Christmas (2014)      0.5
9419                                 Bad Santa 2 (2016)      0.5
9590                             The Emoji Movie (2017)      0.5

### 6번 2015년도에 평가된 모든 Romance 영화의 평균 평점

In [71]:
import time

df2 = pd.merge(df_m,df_rating,left_on="movieId",right_on="movieId",how="inner")
result = df2.loc[df2["genres"].str.contains("Romance")]
result
result_df = pd.DataFrame(columns=["평점"])
start = time.mktime(time.strptime("2015-01-01 00:00:00","%Y-%m-%d %H:%M:%S"))
end = time.mktime(time.strptime("2016-01-01 00:00:00","%Y-%m-%d %H:%M:%S"))
print(result.loc[ (result["timestamp"] >=start) & (result["timestamp"] < end), "rating"].mean() )

3.396375098502758